{
    "ukzFI9rgwfU": [
        "- machines learn from their past experiences and machines follow instructions given by humans but what if humans can train the machines to learn from the past data and do what humans can do and much faster well that's called machine learning.",
        "- machine learning is more than just learning it's also about understanding and reasoning so today we will learn about the basics of machine learning so that's paul he loves listening to new songs he either likes them or dislikes them paul decides this on the basis of the song's tempo genre intensity and the gender of voice.",
        "- supervised learning uses labeled data to train the model here the machine knew the features of the object and also the labels associated with those features on this note.",
        "- Unsupervised learning uses unlabeled data and then there is reinforcement learning which is a reward based learning or we can say that it works on the principle of feedback here.",
        "- We provide feedback to the training model and ask it to predict until it learns i hope you've understood supervised and unsupervisedlearning so let's have a quick quiz.",
        "- machine learning is used in healthcare where diagnostics are predicted for doctor's review the sentiment analysis that the tech giants are doing on social media is another interesting application of machine learning fraud detection in the finance sector and also to predict customer churn in the e-commerce sector.",
        "- While booking a gap you must have encountered surge pricing often where it says the fair of your trip has been updated continue booking."
    ],
    "9gGnTQTYNaE": [
        "- Luv Aggarwal is a Data Platform Solution engineer for IBM.",
        "- He explains what machine learning, or ML, is and how to use it in your business.",
        "- He also explains the different types of machine learning and how they can be used in different use-cases, such as customer retention.",
        "- He concludes by sharing his thoughts on the future of AI and machine learning in the digital world.",
        "- Unsupervised learning is when we use machine learning algorithms to analyze and cluster unlabeled data sets.",
        "- This method helps us discover hidden patterns or groupings without the need for human intervention.",
        "- The last type of machine learning I want to talk about today is called ‘reinforcement learning’ This is a form of semi-supervisedlearning where we typically have an agent or system take actions in an environment.",
        "- I encourage you to dive deeper and learn more about it.",
        "- If you want to know what are some of the common machine learning algorithms and how to leverage them in data science, please check out the links in the description.",
        "- And don't forget, you can grow your skills and earn a badge with IBM Cloud Labs, which are free browser-based interactive Kubernetes labs.",
        "- Thank you."
    ],
    "Fa_V9fP2tpU": [
        "- machine learning is a branch of artificial intelligence that enables computers to learn from data and improve their performance on tasks over time.",
        "- here a list of all basic machine learning terms in 22 minutes.",
        "- artificial intelligence refers to the capability of machines to perform tasks that typically require human intelligence.",
        "- This can include understanding language recognizing images solving problems or making decisions AI aims to mimic human cognitive functions through various techniques including machine learning but not all AI is machine learning.",
        "- A model in machine learning is a mathematical representation that is trained to recognize patterns in data and make predictions or classifications based on those patterns.",
        "- The most common type of model is simply a mapping function between a an input and an output in linear regression.",
        "- Training or learning is the process of adjusting a model's parameters to find the best match between the model's predictions and the actual data.",
        "- The test and training data are separated randomly before beginning the modeling process.",
        "- Unsupervised learning is a type of machine learning where models learn to find patterns and structure in data without being given labeled examples or correct answers.",
        "- Reinforcement learning is the newer branch of machinelearning that has recently been accepted as a third main branch.",
        "- It operates on a fundamentally different principle instead of learning from pre-labeled examples instead of finding patterns in unlabeled data unsupervised it learns from interaction and feedback.",
        "- feature engineering involves using domain knowledge and creativity to transform or combine original features into more meaningful ones.",
        "- Good feature engineering often makes the difference between an average model and an excellent one as it helps the model focus on the most relevant patterns in the data feature scaling also called normalization or standardization is the process of transforming numeric features to a similar scale typically to prevent features with larger ranges from dominating the learning process.",
        "- dimensionality reduction techniques are often crucial in machine learning helping to compress many features into a smaller set while preserving important information.",
        "- Model complexity refers to how sophisticated a machine learning model is in terms of its ability to capture patterns in the data.",
        "- A more complex model has more parameters and can learn more complicated relationships like a neural network with many layers.",
        "- Finding the right level of complexity is crucial too simple and the model fails to capture important patterns which is called underfitting too complex and it learns to fit to noise in the training data rather than true patterns also called overfitting.",
        "- The bias variance trade-off is a fundamental Concept in machine learning that describes the tension between a model's ability to minimize bias and variance.",
        "- High variance often indicates overfitting where the model is learning the random noise and the training data rather than the true underlying patterns.",
        "- The Sweet Spot in this tradeoff is crucial the goal is to create a model that's complex enough to capture true patterns in the data but not so complex that it fits to noise.",
        "- The model is trained five times each time using a different part as the validation set and the remaining parts for training.",
        "- validation sets are used during the model development process to make decisions about hyperparameters and model selection the test set is kept completely separate and used only once at the very end to evaluate the final model's performance.",
        "- Regularization refers to techniques used to prevent overfitting by adding constraints or penalties that discourage a model from becoming too complex or fitting too closely to the train training data.",
        "- gradient descent is a fundamental optimization algorithm used to train machine learning models by iteratively adjusting model parameters to minimize errors.",
        "- gradient descent calculates the direction in which the model's error decreases most rapidly and updates the parameters accordingly for each step.",
        "- The learning rate is a crucial hyperparameter that determines how much a model adjusts its parameters in response to errors during training like a student adjusting their understanding based on on feedback.",
        "- Finding the right learning rate is often critical for successful training too high and the model might never converge too low and training might take unnecessarily long evaluation is the process of measuring how well a machine learning model performs on data it hasn't seen during training.",
        "- this process typically involves both validation to tune the model during development and testing.",
        "- evaluation helps determine whether a model has truly learned use patterns or has just memorized the training data."
    ],
    "vdRp_w9f-qM": [
        "- Ivan savov's Noble guide to math and physics found this to be a great refresher to math fundamentals.",
        "- Joel gruse first principles with python this is a brilliant book to understand the nuts and bolts behind some of the most popular machine learning algorithms.",
        "- Quest illustrator guide to machine learning a triple band these are the books I've been devouring over the last couple of months.",
        "- I also bought his guide to linear algebra data science from scratch."
    ],
    "PeMlggyqz0Y": [
        "- machine learning teach a computer how to perform a task without explicitly programming it to perform said task instead feed data into an algorithm to gradually improve outcomes.",
        "- The term was coined in 1959 by Arthur Samuel at IBM who is developing artificial intelligence that could play checkers half a century later.",
        "- predictive models are embedded in many of the products we use every day which perform two fundamental jobs one is to classify data and the other is to make predictions about future outcomes.",
        "- Thanks for watching and I will see you in the next one.",
        "- learning content on this channel thanks for watching.",
        "- and I'll see you next time.",
        "- learn content onthis channel.",
        "- learn more on CNN.com/CNN iReport: Do you know more about CNN iReport?",
        "- If so, please send an email to jennifer.smith@mailonline.co.uk and we will feature it on our channel."
    ],
    "E0Hmnixke2g": [
        "- In 17 minutes Tim will give you an overview of the most important machine learning algorithms to help you decide which one is right for your problem.",
        "- Tim has been a data scientist for over 10 years and taught all of these algorithms to hundreds of students in real life machine learning boot camps.",
        "- In 17 minutes you will know how to pick the right algorithm for any problem and get a basic intuition of each algorithm and how they relate to each other.",
        "- Machine learning algorithms try to determine the relationship between two variables.",
        "- In classification we try to assign a discrete categorical label also called a class to a data point.",
        "- Logistic regression is a variant of linear regression and probably the most basic classification algorithm.",
        "- Instead of fitting a line to two numerical variables with a presumably linear relationship you now try to predict a categorical output variable using categorical or numerical input variables.",
        "- The K nearest neighbors algorithm or KNN is a very simple and intuitive algorithm that can be used for both regression and class ification.",
        "- The name means that we don't try to fit any equations and thus find any parameters of a model so no true model fitting is necessary.",
        "- The core concept of the algorithm is to draw a decision boundary between data points that separates data points of the training set as well as possible.",
        "- SPM is very powerful in high Dimensions that is if the number of features is large compared to the size of the data in those higher dimensional cases the decision boundary is called a hyperplane.",
        "- Another feature that makes SPM extremely powerful is the use of so-called kernel functions which allow for the identification of Highly complex nonlinear decision boundaries.",
        "- kernel functions are an implicit way to turn your original features into new more complex features.",
        "- artificial neural networks are designed to implicitly and automatically design these features for us without any guidance from humans we do this by adding additional layers of unknown variables between the input and output variables in its simplest form this is called a single layer percep chop which is basically just a multi-feature regression task.",
        "- If we add a hidden layer the hidden variables in the middle layer represent some hidden unknown features and instead of predicting the target variable directly we try to classify the image.",
        "- Deep learning can result in very complex hidden features that might represent all kinds of complex information in the pictures.",
        "- We don't usually know what the hidden features represent we just train the neural network to predict the final Target as well as possible.",
        "- The most famous clustering algorithm is called K means clustering just like for KNN K is a hyperparameter and stands for the number of clusters you are looking for.",
        "- K means is the most famous and most common clustering algorithm.",
        "- dimensionality reduction is to reduce the number of features or dimensions of your data set keeping as much information as possible.",
        "- This group of algorithms does this by finding correlations between existing features and removing potentially redundant Dimensions without losing much information.",
        "- If you are overwhelmed and don't know which algorithm you need here is a great cheat sheet by syit learn to help you decide which algorithm is right for which type of problem."
    ],
    "VDiyQub6vpw": [
        "- Plato was born into a wealthy family in Athens, 2400 years ago.",
        "- He devoted his life to helping people to reach a state of fulfilment.",
        "- He had four big ideas for making life more fulfilled.",
        "- First big idea: Think more.",
        "- Second Big idea: Let your lover change you.",
        "- Third: decode the message of beauty.",
        "- Fourth: Follow your heart and live your life to the full.",
        "- Beautiful objects are whispering important truths to us about the good life.",
        "- Ugliness is a serious matter too.",
        "- it parades dangerous and damaged characteristics in front of us.",
        "- It makes it harder to be wise, kind and calm.",
        "- Plato sees art as therapeutic: it is the duty of poets and painters (and nowadays, novelists, television producers and designers) to help us live good lives.",
        "- He wanted philosophy to be a tool to help us change the world.",
        "- We should continue to be inspired by his example.",
        "- What unites them is their ambition and their idealism.",
        "- He was a man of great ambition and idealism, and we should follow in his footsteps.",
        "- We need to follow his example and continue to improve the world we live in.",
        "- We must be the change we want to see in this world."
    ],
    "cuciCYhTq3Y": [
        "- This guy is pushing the boundaries of color theory using just red yellow and blue he's on a mission to create white you won't believe which color he uses to mix and make white.",
        "- After making white he's creating another color by mixing the original redyellow and blue with the color he just made keep watching to see how many colors he can create with just those [Music] colors let me know if you're amazed subscribe if you appreciate his work."
    ],
    "q71NZKwBnPg": [
        "- sas stands for the synthetically awesome style sheet is a css pre-compiler that allows you to write codes or css code that's similar to regular programming languages like javascript.",
        "- It structures your code using functions mixins nested attributes variables that are properly defined.",
        "- It makes life of writing cs a little bit more balanced and actually making you have fun while writing css so without wasting much time let's get started.",
        "- Style.scss is a file that's going to be stored within the scss folder we also go ahead and create another file called style.script.",
        "- Within the distributed folder all changes we make to the style.",
        "- scss will be saved and will be outputted to the css folder.",
        "- We can easily reference pseudoproperties of an element for example the hoover property of the a tag by using an ampersand and the pseudo element.",
        "- We're going to create a partial chord function.",
        "- that around the website and if we give the spy with an id of one to extend the border prop is going to inherit all the properties or declarations that within that border design regardless of the fact that by inheriting one section of the border design we can also overwrite it.",
        "- We're also creating a mixing within the function.scss and we're giving it a name of transform this example was pulled off directly from the sars website."
    ],
    "jUZzAUuMHVI": [
        "- This video is brought to you by deaf mountain coding boot camp if you guys are trying to get into software development iOS development software QA and other stuff check out the link in the description tab below they are offering courses you can actually live on campus over there they are hooked up with employers around the country around the world really and they're gonna help you try to find your first job in this industry.",
        "- Sass is a CSS preprocessor language and really the most popular one that's used by the most companies.",
        "- To actually get started with sass all you have to do is have node installed so you have NPM the package manager and you're gonna say install so I'm still typing with ten stitches in my hand and then - g4 global and then just type in sass and that's gonna this is the easiest way just to get started.",
        "- The variables alone give CSS a lot more power so again all these pre processor processor languages are very similar in nature.",
        "- You're gonna find similar functionality in all of them so now in order to actually use that compile to compile that that sass file we're gonna go to the directory where it's located and you just say sass - - watch and then the name of the file you actually want to watch which is test is CSS.",
        "- Sass has the ability to have functions that take in a value and spit back all the different styles and everything that you're gonna end up applying.",
        "- It also has this extends functionality so again you could have some team that's like saying what are all the common age ones look like so we're gonna say like a common h1 this is the name of our shared and we can go ahead and give it a few things like font family.",
        "- CSS preprocessor languages are worth learning in 2019 I definitely do I think depending on whatever sort of profession you're in you may or may not actually deal with it.",
        "- Some of the downsides to sass is that you used to have to download like Ruby and install Ruby to use compass to compile it and a lot of people are like screw that and you have companies that don't want to deal with that sort of overhead things like that."
    ],
    "6M5VXKLf4D4": [
        "- Deep learning is a type of machine learning inspired by the structure of the human brain.",
        "- It is a subset of artificial intelligence which is a technique that enables a machine to mimic human behavior.",
        "- The features are picked out by the neural network without human intervention.",
        "- Where is deep learning applied in customer support when most people converse with customer support agents the conversation seems so real they don't even realize that it's actually a bot.",
        "- Deep learning is the most efficient way to deal with unstructured data a neural network requires a massive volume of data to train.",
        "- neural networks detect cancer cells and analyze mri images to give detailed results self-driving cars what seem like science fiction is now a reality.",
        "- horus technology working on a device for the blind that uses deep learning with computer vision to describe the world to the users replicating the human mind at the entirety."
    ],
    "FZmR_m0KuC8": [
        "The transcript is too short to summarize."
    ],
    "aircAruvnKk": [
        "- In this video, we look at how a neural network can learn to recognize handwritten digits.",
        "- In the next, we'll look at the structure of the network, and how it's used to learn.",
        "- We'll also look at some of the more powerful modern variants of neural networks.",
        "- And at the end of the two videos I want to point you to a couple good resources where you can learn more, and download the code that does this.",
        "- neural networks are inspired by the brain, but let's break that down.",
        "- What are the neurons, and in what sense are they linked together?",
        "- Right now when I say neuron all I want you to think about is a thing that holds a number, specifically a number between 0 and 1.",
        "- For example the network starts with a bunch of neurons corresponding to each of the 28x28 pixels of the input image.",
        "- When you or I recognize digits, we piece together various components.",
        "- A 9 has a loop up top and a line on the right.",
        "- An 8 also has aloop up top, but it's paired with another loop down low.",
        "- A 4 basically breaks down into three specific lines, and things like that.",
        "- In a perfect world, we might hope that each neuron in the second to last layer corresponds with one of these subcomponents.",
        "- The goal is to have some mechanism that could conceivably combine pixels into edges, or edges into patterns, or patterns into digits.",
        "- To zoom in on one very specific example, let's say the hope is for one particular neuron in the second layer to pick up on whether or not the image has an edge in this region here.",
        "- The question at hand is what parameters should the network have?",
        "- What dials and knobs should you be able to tweak?",
        "- With this hidden layer of 16 neurons, that's a total of 784 times 16 weights, along with 16 biases.",
        "- The weights tell you what pixel pattern this neuron in the second layer is picking up on, and the bias tells you how high the weighted sum needs to be before the neuron starts getting meaningfully active.",
        "- All said and done, this network has almost exactly 13,000 total weights and biases.",
        "- The entire network is just a function, one that takes in 784 numbers as an input and spits out 10 as an output.",
        "- It's an absurdly complicated function that involves 13,000 parameters.",
        "- How does this network learn the appropriate weights and biases just by looking at data?",
        "- In the next video, I'll also dig a little more into what this particular network we're seeing is really doing.",
        "- Lisha Li did her PhD work on the theoretical side of deep learning.",
        "- She currently works at a venture capital firm called Amplify Partners.",
        "- They kindly provided some of the funding for this video.",
        "- Lisha: I'm jumping back into it after this project, so patrons you can look out for updates there.",
        "- in the probability series this summer, but I'll be back in the fall."
    ],
    "M988_fsOSWo": [
        "- Cloud computing refers to the delivery of on-demand computing services over the internet on a pay-as-you-go basis.",
        "- On-premise systems need a lot of space for their servers notwithstanding the power and maintenance hassles that come with them.",
        "- Cloud computing solutions are offered by cloud service providers who manage and maintain the servers saving you both money and space.",
        "- A hybrid cloud is a combination of the functionalities of both public and private clouds.",
        "- There are three major service models available es pass and sas compared to on-premise models where you'll need to manage and maintain every component including applications data virtualization and middleware cloud computing service models are hassle-free.",
        "- Let us know your answer in the comments section below for a chance to win an amazon voucher coming back to cloud computing some of the most popular cloud computing services in the market are aws or amazon web services microsoft azure and google cloud platform."
    ],
    "_a6us8kaq0g": [
        "- The term cloud computing refers to data and applications being stored and run on the cloud rather than being stored on your local computer or on any equipment that you own.",
        "- So the workload is no longer on your computer, but on a cloud.",
        "- What is the cloud?",
        "- The cloud is just a big building that's filled with computers.",
        "- The companies that own these clouds are called cloud providers and their purpose is to sell their computers as a service.",
        "- With cloud computing a person or company eliminates a lot of the expense of buying their own hardware and software, along with the building maintenance and electricity it takes to run their own data center.",
        "- Another reason is reliability.",
        "- When you hire a cloud, the cloud provider is responsible for all of the data backup and disaster recovery.",
        "- And if one of its data centers goes down, they will also have several redundant sites as a backup which will ensure that there is no downtime.",
        "- There are three types of cloud services: infrastructure as a service, platform as aService, and software as a Service.",
        "- Infrastructure as aservice allows the cloud provider to manage a portion of your business.",
        "- Platform as a services allows the user to decide what suits their needs.",
        "- Software as a Services allows you to access and run applications from your computer when you connect to the cloud service through the internet."
    ],
    "kjBOesZCoqc": [
        "- linear algebra is one of those subjects that's required knowledge for just about any technical discipline.",
        "- There's a fundamental difference between understanding linear algebra on a numeric level and understanding it on a geometric level.",
        "- If you learn linear algebra without getting a solid foundation in that geometric understanding, the problems can go unnoticed for a while until you've gone deeper into whatever field you happen to pursue, whether that's computer science, engineering, statistics, or even math itself.",
        "- The goal is to create a short, binge-watchable series animating those intuitions from the basics of vectors up through the core topics that make up the essence of linear algebra.",
        "- I'll put out one video per day for the next five days, then after that put out a new chapter every one to two weeks.",
        "- I also hope this can be a resource for educators who are teaching courses that assume fluency with linear algebra, giving them a place to direct students."
    ]
}